Revit 2027 API
CompoundStructure.GetOffsetForLocationLine Method
 Returns the offset from the center of the compound structure to the given location line value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetOffsetForLocationLine(
	WallLocationLine wallLocationLine
)
Public Function GetOffsetForLocationLine (
	wallLocationLine As WallLocationLine
) As Double
public:
double GetOffsetForLocationLine(
	WallLocationLine wallLocationLine
)
member GetOffsetForLocationLine :
        wallLocationLine : WallLocationLine -> float
Parameters
wallLocationLine WallLocationLine
 The alignment type of the wall's location line.
Return Value
Double
 The offset.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  This operation is valid only vertically homogeneous compound structures.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace